app/controllers/sessions_controller.rb

  def create
    user = User.find_by(:username => params[:session][:username].downcase)
---
SELECT `users`.* FROM `users` WHERE `users`.`username` = 'wenderen' LIMIT 1