app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO `users` (`created_at`, `dateOfBirth`, `emailID`, `latitude`, `longitude`, `password`, `realName`, `updated_at`, `username`) VALUES ('2013-11-03 16:56:35', '2013-11-04', 'tarunkathuria@gmail.com', 5.0, 6.0, 'tarun321', 'Tarun Kathuria', '2013-11-03 16:56:35', 'tarunkathuria')